# In this jupyter notebook, ...

### Import Required Libraries

In [96]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import plotly.express as px

### Load the data

In [97]:
from pathlib import Path

def load_data(file_path) -> pd.DataFrame:
    p = Path(str(file_path).strip()).expanduser().resolve()

    if not p.exists():
        raise FileNotFoundError(f"File not found: {p}")
    
    return pd.read_csv(p)

In [98]:
t20_bat = load_data(r"D:\Languages\Projects\ml-portfolio\EDA\data\Tabular\Batting\t20.csv")
odi_bat = load_data(r"D:\Languages\Projects\ml-portfolio\EDA\data\Tabular\Batting\ODI data.csv")
test_bat = load_data(r"D:\Languages\Projects\ml-portfolio\EDA\data\Tabular\Batting\test.csv")

In [99]:
df_dict = {
    't20_bat': t20_bat,
    'odi_bat': odi_bat,
    'test_bat': test_bat
}

### Preview the data

In [100]:
for name, df in df_dict.items():
    print()
    print(f"DataFrame: {name}")
    print(f"Shape: {df.shape}")
    display(df.head(6))
    print("-"*135)

DataFrame: t20_bat
Shape: (2006, 17)

,Unnamed: 0,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,4s,6s,Unnamed: 15
0,0,V Kohli (INDIA),2010-2019,75,70,20,2633,94*,52.66,1907,138.07,0,24,2,247,71,NaN
1,1,RG Sharma (INDIA),2007-2019,104,96,14,2633,118,32.1,1905,138.21,4,19,6,234,120,NaN
2,2,MJ Guptill (NZ),2009-2019,83,80,7,2436,105,33.36,1810,134.58,2,15,2,215,113,NaN
3,3,Shoaib Malik (ICC/PAK),2006-2019,111,104,30,2263,75,30.58,1824,124.06,0,7,1,186,61,NaN
4,4,BB McCullum (NZ),2005-2015,71,70,10,2140,123,35.66,1571,136.21,2,13,3,199,91,NaN
5,5,DA Warner (AUS),2009-2019,76,76,8,2079,100*,30.57,1476,140.85,1,15,5,203,86,NaN

---------------------------------------------------------------------------------------------------------------------------------------

DataFrame: odi_bat
Shape: (2500, 15)

,Unnamed: 0,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,Unnamed: 13
0,0,SR Tendulkar (INDIA),1989-2012,463,452,41,18426,200*,44.83,21367,86.23,49,96,20,NaN
1,1,KC Sangakkara (Asia/ICC/SL),2000-2015,404,380,41,14234,169,41.98,18048,78.86,25,93,15,NaN
2,2,RT Ponting (AUS/ICC),1995-2012,375,365,39,13704,164,42.03,17046,80.39,30,82,20,NaN
3,3,ST Jayasuriya (Asia/SL),1989-2011,445,433,18,13430,189,32.36,14725,91.2,28,68,34,NaN
4,4,DPMD Jayawardene (Asia/SL),1998-2015,448,418,39,12650,144,33.37,16020,78.96,19,77,28,NaN
5,5,Inzamam-ul-Haq (Asia/PAK),1991-2007,378,350,53,11739,137*,39.52,15812,74.24,10,83,20,NaN

---------------------------------------------------------------------------------------------------------------------------------------

DataFrame: test_bat
Shape: (3001, 13)

,Unnamed: 0,Player,Span,Mat,Inns,NO,Runs,HS,Ave,100,50,0,Unnamed: 11
0,0,SR Tendulkar (INDIA),1989-2013,200,329,33,15921,248*,53.78,51,68,14,NaN
1,1,RT Ponting (AUS),1995-2012,168,287,29,13378,257,51.85,41,62,17,NaN
2,2,JH Kallis (ICC/SA),1995-2013,166,280,40,13289,224,55.37,45,58,16,NaN
3,3,R Dravid (ICC/INDIA),1996-2012,164,286,32,13288,270,52.31,36,63,8,NaN
4,4,AN Cook (ENG),2006-2018,161,291,16,12472,294,45.35,33,57,9,NaN
5,5,KC Sangakkara (SL),2000-2015,134,233,17,12400,319,57.4,38,52,11,NaN

---------------------------------------------------------------------------------------------------------------------------------------

In [101]:
for name, df in df_dict.items():
    print(f"\nDataFrame: {name}\n")
    df.info()
    print('-' * 100)
    display(df.describe())
    print('=' * 135)
    print('=' * 135)

DataFrame: t20_bat

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2006 entries, 0 to 2005
Data columns (total 17 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   2006 non-null   int64
 1   Player       2006 non-null   object
 2   Span         2006 non-null   object
 3   Mat          2006 non-null   int64
 4   Inns         2006 non-null   object
 5   NO           2006 non-null   object
 6   Runs         2006 non-null   object
 7   HS           2006 non-null   object
 8   Ave          2006 non-null   object
 9   BF           2006 non-null   object
 10  SR           2006 non-null   object
 11  100          2006 non-null   object
 12  50           2006 non-null   object
 13  0            2006 non-null   object
 14  4s           2006 non-null   object
 15  6s           2006 non-null   object
 16  Unnamed: 15  0 non-null      float64
dtypes: float64(1), int64(2), object(14)
memory usage: 266.6+ KB
----------------------------------------------------------------------------------------------------

        Unnamed: 0          Mat  Unnamed: 15
count  2006.000000  2006.000000          0.0
mean     24.434197    11.231805          NaN
std      14.463176    14.923332          NaN
min       0.000000     1.000000          NaN
25%      12.000000     3.000000          NaN
50%      24.000000     5.000000          NaN
75%      37.000000    13.000000          NaN
max      49.000000   111.000000          NaN

=======================================================================================================================================
=======================================================================================================================================

DataFrame: odi_bat

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2500 entries, 0 to 2499
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   2500 non-null   int64
 1   Player       2500 non-null   object
 2   Span         2500 non-null   object
 3   Mat          2500 non-null   int64
 4   Inns         2500 non-null   object
 5   NO           2500 non-null   object
 6   Runs         2500 non-null   object
 7   HS           2500 non-null   object
 8   Ave          2500 non-null   object
 9   BF           2500 non-null   object
 10  SR           2500 non-null   object
 11  100          2500 non-null   object
 12  50           2500 non-null   object
 13  0            2500 non-null   object
 14  Unnamed: 13  0 non-null      float64
dtypes: float64(1), int64(2), object(12)
memory usage: 293.1+ KB
----------------------------------------------------------------------------------------------------

        Unnamed: 0          Mat  Unnamed: 13
count  2500.000000  2500.000000          0.0
mean     24.500000    37.161600          NaN
std      14.433757    58.885075          NaN
min       0.000000     1.000000          NaN
25%      12.000000     4.000000          NaN
50%      24.500000    13.000000          NaN
75%      37.000000    43.000000          NaN
max      49.000000   463.000000          NaN

=======================================================================================================================================
=======================================================================================================================================

DataFrame: test_bat

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3001 entries, 0 to 3000
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   3001 non-null   int64
 1   Player       3001 non-null   object
 2   Span         3001 non-null   object
 3   Mat          3001 non-null   int64
 4   Inns         3001 non-null   object
 5   NO           3001 non-null   object
 6   Runs         3001 non-null   object
 7   HS           3001 non-null   object
 8   Ave          3001 non-null   object
 9   100          3001 non-null   object
 10  50           3001 non-null   object
 11  0            3001 non-null   object
 12  Unnamed: 11  0 non-null      float64
dtypes: float64(1), int64(2), object(10)
memory usage: 304.9+ KB
----------------------------------------------------------------------------------------------------

        Unnamed: 0          Mat  Unnamed: 11
count  3001.000000  3001.000000          0.0
mean     24.491836    17.427191          NaN
std      14.437798    24.954654          NaN
min       0.000000     1.000000          NaN
25%      12.000000     2.000000          NaN
50%      24.000000     7.000000          NaN
75%      37.000000    21.000000          NaN
max      49.000000   200.000000          NaN

=======================================================================================================================================
=======================================================================================================================================

##### There is only one string column in all these three dfs, which is player, and everything else should be integer or float. 
##### Therefore:

## Data Cleaning & Feature engineering

In [102]:
for name, df in df_dict.items():
    print(f"\nDataFrame: {name}")
    print('-'*20)
    display(df.isna().sum())
    print('='*50)

DataFrame: t20_bat
--------------------

Unnamed: 0        0
Player            0
Span              0
Mat               0
Inns              0
NO                0
Runs              0
HS                0
Ave               0
BF                0
SR                0
100               0
50                0
0                 0
4s                0
6s                0
Unnamed: 15    2006
dtype: int64

==================================================

DataFrame: odi_bat
--------------------

Unnamed: 0        0
Player            0
Span              0
Mat               0
Inns              0
NO                0
Runs              0
HS                0
Ave               0
BF                0
SR                0
100               0
50                0
0                 0
Unnamed: 13    2500
dtype: int64

==================================================

DataFrame: test_bat
--------------------

Unnamed: 0        0
Player            0
Span              0
Mat               0
Inns              0
NO                0
Runs              0
HS                0
Ave               0
100               0
50                0
0                 0
Unnamed: 11    3001
dtype: int64

==================================================

- First column and last column are useless. 
- Also, we need to change some dtypes here.
- t20_bat have 15 cols out of which 2 cols (4s and 6s) are not in odi_bat. <--> ( lacks -> [ 4s, 6s ] cols)
- odi_bat have 13 cols out of which 2 cols (BF and SR) are not present in test_bat. <--> ( lacks -> [ 4s, 6s, BF, SR ] cols)

In [103]:
for name, df in df_dict.items():
    if name == 't20_bat':
        i = 156
    elif name == 'odi_bat':
        i = 11
    elif name == 'test_bat':
        i = 21
    print(f"\nDataFrame: {name}")   
    display(df.tail(i))
    print("="*120)

DataFrame: t20_bat

,Unnamed: 0,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,4s,6s,Unnamed: 15
1850,0,Taijul Islam (BDESH),2019-2019,2,1,1,0,0*,-,1,0.00,0,0,0,0,0,NaN
1851,1,Ziaur Rehman (Fin),2019-2019,1,1,0,0,0,0.00,4,0.00,0,0,1,0,0,NaN
1852,2,M Zondeki (SA),2006-2006,1,1,0,0,0,0.00,1,0.00,0,0,1,0,0,NaN
1853,3,Zulqarnain Haider (ESP),2019-2019,5,1,0,0,0,0.00,0,-,0,0,1,0,0,NaN
1854,4,YA Abdulla (SA),2009-2009,2,-,-,-,-,-,-,-,-,-,-,-,-,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2001,1,SG Whittingham (SCOT),2018-2018,3,-,-,-,-,-,-,-,-,-,-,-,-,NaN
2002,2,LJ Woodcock (NZ),2010-2011,3,-,-,-,-,-,-,-,-,-,-,-,-,NaN
2003,3,Zamir Khan (AFG),2012-2012,1,-,-,-,-,-,-,-,-,-,-,-,-,NaN
2004,4,S Zargar (Mex),2019-2019,1,-,-,-,-,-,-,-,-,-,-,-,-,NaN
2005,5,Ziaur Rahman (AFG),2019-2019,1,-,-,-,-,-,-,-,-,-,-,-,-,NaN

========================================================================================================================

DataFrame: odi_bat

,Unnamed: 0,Player,Span,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,Unnamed: 13
2489,39,Zakir Hossain (BDESH),1998-1998,1,1,0,0,0,0.00,1,0.00,0,0,1,NaN
2490,40,Aamer Hameed (PAK),1977-1978,2,-,-,-,-,-,-,-,-,-,-,NaN
2491,41,Abdur Rauf (PAK),2008-2008,4,-,-,-,-,-,-,-,-,-,-,NaN
2492,42,Abu Jayed (BDESH),2019-2019,2,-,-,-,-,-,-,-,-,-,-,NaN
2493,43,FS Ahangama (SL),1985-1985,1,-,-,-,-,-,-,-,-,-,-,NaN
2494,44,GW Aldridge (NZ),2011-2011,2,-,-,-,-,-,-,-,-,-,-,NaN
2495,45,ZS Ansari (ENG),2015-2015,1,-,-,-,-,-,-,-,-,-,-,NaN
2496,46,Ariful Haque (BDESH),2018-2018,1,-,-,-,-,-,-,-,-,-,-,NaN
2497,47,Ashfaq Ahmed (PAK),1994-1994,3,-,-,-,-,-,-,-,-,-,-,NaN
2498,48,MD Bailey (NZ),1998-1998,1,-,-,-,-,-,-,-,-,-,-,NaN
2499,49,GR Beard (AUS),1981-1981,2,-,-,-,-,-,-,-,-,-,-,NaN

========================================================================================================================

DataFrame: test_bat

,Unnamed: 0,Player,Span,Mat,Inns,NO,Runs,HS,Ave,100,50,0,Unnamed: 11
2980,30,Zahir Khan (AFG),2019-2019,2,4,3,0,0*,0.00,0,0,1,NaN
2981,31,Ali Hussain Rizvi (PAK),1997-1997,1,-,-,-,-,-,-,-,-,NaN
2982,32,PJ Allan (AUS),1965-1965,1,-,-,-,-,-,-,-,-,NaN
2983,33,JC Clay (ENG),1935-1935,1,-,-,-,-,-,-,-,-,NaN
2984,34,DJ Cullen (AUS),2006-2006,1,-,-,-,-,-,-,-,-,NaN
2985,35,HT Dani (INDIA),1952-1952,1,-,-,-,-,-,-,-,-,NaN
2986,36,Farrukh Zaman (PAK),1976-1976,1,-,-,-,-,-,-,-,-,NaN
2987,37,AB Howard (WI),1972-1972,1,-,-,-,-,-,-,-,-,NaN
2988,38,A Khan (ENG),2009-2009,1,-,-,-,-,-,-,-,-,NaN
2989,39,JCW MacBryan (ENG),1924-1924,1,-,-,-,-,-,-,-,-,NaN
2990,40,LR Pierre (WI),1948-1948,1,-,-,-,-,-,-,-,-,NaN
2991,41,V Rajindernath (INDIA),1952-1952,1,-,-,-,-,-,-,-,-,NaN
2992,42,HD Read (ENG),1935-1935,1,-,-,-,-,-,-,-,-,NaN
2993,43,CF Root (ENG),1926-1926,3,-,-,-,-,-,-,-,-,NaN
2994,44,Shahid Mahboob (PAK),1989-1989,1,-,-,-,-,-,-,-,-,NaN
2995,45,RC Shukla (INDIA),1982-1982,1,-,-,-,-,-,-,-,-,NaN
2996,46,CA Snedden (NZ),1947-1947,1,-,-,-,-,-,-,-,-,NaN
2997,47,VN Swamy (INDIA),1955-1955,1,-,-,-,-,-,-,-,-,NaN
2998,48,Usman Shinwari (PAK),2019-2019,1,-,-,-,-,-,-,-,-,NaN
2999,49,CM Willoughby (SA),2003-2003,2,-,-,-,-,-,-,-,-,NaN
3000,0,JW Wilson (AUS),1956-1956,1,-,-,-,-,-,-,-,-,NaN

========================================================================================================================

#### We can see
- In t20_bat df, we have null values from 1853,
- In odi_bat df, we have null values starting from 2490,
- In test_bat df, we have null values from 2981.
-> We should drop them as they contain No Data.

####  We also have some null values in Ave and SR.
- All of these are not in NaN, but they are string '-'. Therefore, we first have to convert them into nan, then change the dtypes.

#### HS has some values like 98*, it means the player was not out at his highest score.
- We will make another feature named as 'hs_not_out', it will contain boolean values (True if '*' else False)
- HS will then contain plain numeric values without '*'

In [104]:
# i = 15
# for name, df in df_dict.items():
#     df.drop(columns=[col for col in [f'Unnamed: 0', f'Unnamed: {i}'] if col in df.columns], inplace=True)
#     i -= 2

In [105]:
# Row indices after which we drop data
drop_start_index = {
    't20_bat': 1853,
    'odi_bat': 2490,
    'test_bat': 2981
}


# Loop over each dataframe
for name, df in df_dict.items():
    # Drop columns named Unnamed
    df.drop(columns=[col for col in df.columns if col.startswith('Unnamed')], inplace=True)

    # Drop rows starting from given index
    df.drop(df.index[drop_start_index[name]:], inplace=True)

    # Replace '-' with NaN (in place)
    df.replace('-', np.nan, inplace=True)

    # Span split
    df[['span_start', 'span_end']] = df['Span'].str.split('-', expand=True)
    
    # Optional: convert to datetime
    # df['span_start'] = pd.to_datetime(df['span_start'], format='%Y')
    # df['span_end'] = pd.to_datetime(df['span_end'], format='%Y')

    df.drop(columns='Span', inplace=True)

    # HS feature extraction
    df['hs_not_out'] = df['HS'].str.contains(r"\*")
    df['HS'] = df['HS'].str.extract(r"(\d+)")
    
    # Convert dtypes accordingly (excluding Player, Span, hs_not_out)
    for col in df.columns[2:-1]:
        df[col] = pd.to_numeric(df[col], errors='coerce')

    # Persist changes
    df_dict[name] = df

    tnv = df.isna().sum().sum()  # total null values (in a df)
    print(f"\nDataframe: '{name}'\n")
    print(f"Total null values: {tnv} ({(tnv / df.shape[0])*100:.2f}%)")
    print(f"Total duplicate values: {df.duplicated().sum()}")
    print(f"Shape: {df.shape[0]} rows Ã— {df.shape[1]} columns")
    print('-'*50)
    df.info()
    print('-'*35)
    display(df.sample(10))
    print('='*135)

Dataframe: 't20_bat'

Total null values: 198 (10.69%)
Total duplicate values: 0
Shape: 1853 rows Ã— 17 columns
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1853 entries, 0 to 1852
Data columns (total 17 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Player      1853 non-null   object
 1   Mat         1853 non-null   int64
 2   Inns        1853 non-null   int64
 3   NO          1853 non-null   int64
 4   Runs        1853 non-null   int64
 5   HS          1853 non-null   int64
 6   Ave         1677 non-null   float64
 7   BF          1853 non-null   int64
 8   SR          1831 non-null   float64
 9   100         1853 non-null   int64
 10  50          1853 non-null   int64
 11  0           1853 non-null   int64
 12  4s          1853 non-null   int64
 13  6s          1853 non-null   int64
 14  span_start  1853 non-null   int64
 15  span_end    1853 non-null   int64
 16  hs_not_out  1853 non-null   bool
dtypes: bool(1), float64(2), int64(13), object(1)
memory usage: 233.6+ KB
-----------------------------------

,Player,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,4s,6s,span_start,span_end,hs_not_out
561,ML Udawatte (SL),8,8,0,96,25,12.00,87,110.34,0,0,2,10,2,2008,2017,False
1469,E Schiferli (NL),7,3,1,7,5,3.50,16,43.75,0,0,1,0,0,2008,2010,True
794,DM Nakrani (UGA),4,4,1,52,19,17.33,48,108.33,0,0,0,2,3,2019,2019,False
1625,R Ulutuna (TKY),4,4,0,3,1,0.75,16,18.75,0,0,1,0,0,2019,2019,False
644,NFI McCallum (SCOT),11,7,0,76,38,10.85,85,89.41,0,0,3,7,1,2007,2010,False
581,GM Hamilton (SCOT),12,8,0,90,32,11.25,110,81.81,0,0,0,6,1,2007,2010,False
1270,JWN Moses (Botsw),3,3,0,14,9,4.66,20,70.00,0,0,0,0,1,2019,2019,False
336,J Botha (SA),40,20,9,201,34,18.27,165,121.81,0,0,1,15,9,2006,2012,False
379,Umar Gul (PAK),60,27,9,165,32,9.16,156,105.76,0,0,6,11,10,2007,2016,False
782,GD Drummond (SCOT),17,7,0,54,35,7.71,65,83.07,0,0,2,3,0,2008,2013,False

=======================================================================================================================================

Dataframe: 'odi_bat'

Total null values: 129 (5.18%)
Total duplicate values: 0
Shape: 2490 rows Ã— 15 columns
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2490 entries, 0 to 2489
Data columns (total 15 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Player      2490 non-null   object
 1   Mat         2490 non-null   int64
 2   Inns        2490 non-null   int64
 3   NO          2490 non-null   int64
 4   Runs        2490 non-null   int64
 5   HS          2490 non-null   int64
 6   Ave         2370 non-null   float64
 7   BF          2490 non-null   int64
 8   SR          2481 non-null   float64
 9   100         2490 non-null   int64
 10  50          2490 non-null   int64
 11  0           2490 non-null   int64
 12  span_start  2490 non-null   int64
 13  span_end    2490 non-null   int64
 14  hs_not_out  2490 non-null   bool
dtypes: bool(1), float64(2), int64(11), object(1)
memory usage: 274.9+ KB
-----------------------------------

,Player,Mat,Inns,NO,Runs,HS,Ave,BF,SR,100,50,0,span_start,span_end,hs_not_out
1773,BW Hilfenhaus (AUS),25,11,8,29,16,9.66,69,42.02,0,0,0,2007,2012,False
257,MS Wade (AUS),94,80,11,1777,100,25.75,2164,82.11,1,10,5,2012,2017,True
897,LM Jongwe (ZIM),22,19,3,236,46,14.75,303,77.88,0,0,2,2014,2016,False
1837,ST Gabriel (WI),25,16,9,24,12,3.42,63,38.09,0,0,4,2016,2019,True
1397,OL Pitcher (BMUDA),5,5,0,72,30,14.40,217,33.17,0,0,1,2007,2007,False
634,CH Morris (SA),42,27,4,467,62,20.30,465,100.43,0,1,0,2013,2019,False
169,SV Carlisle (ZIM),111,107,8,2740,121,27.67,4325,63.35,3,9,11,1995,2005,True
1815,RJ van Vuuren (NAM),5,5,2,26,14,8.66,38,68.42,0,0,2,2003,2003,False
952,Ijaz Faqih (PAK),27,19,3,197,42,12.31,351,56.12,0,0,4,1980,1988,True
186,VG Kambli (INDIA),104,97,21,2477,106,32.59,3443,71.94,2,14,4,1991,2000,False

=======================================================================================================================================

Dataframe: 'test_bat'

Total null values: 68 (2.28%)
Total duplicate values: 0
Shape: 2981 rows Ã— 13 columns
--------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2981 entries, 0 to 2980
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Player      2981 non-null   object
 1   Mat         2981 non-null   int64
 2   Inns        2981 non-null   int64
 3   NO          2981 non-null   int64
 4   Runs        2981 non-null   int64
 5   HS          2981 non-null   int64
 6   Ave         2913 non-null   float64
 7   100         2981 non-null   int64
 8   50          2981 non-null   int64
 9   0           2981 non-null   int64
 10  span_start  2981 non-null   int64
 11  span_end    2981 non-null   int64
 12  hs_not_out  2981 non-null   bool
dtypes: bool(1), float64(1), int64(10), object(1)
memory usage: 282.5+ KB
-----------------------------------

,Player,Mat,Inns,NO,Runs,HS,Ave,100,50,0,span_start,span_end,hs_not_out
1998,Harry Elliott (ENG),4,5,1,61,37,15.25,0,0,0,1928,1934,True
838,S Amarnath (INDIA),10,18,0,550,124,30.55,1,3,1,1976,1978,False
1832,AS Joseph (WI),9,15,0,84,34,5.60,0,0,5,2016,2019,False
1154,HJ Howarth (NZ),30,42,18,291,61,12.12,0,1,7,1969,1977,False
599,WL Murdoch (AUS/ENG),19,34,5,908,211,31.31,2,1,3,1877,1892,False
861,CL Vincent (SA),25,38,12,526,60,20.23,0,2,4,1927,1935,False
821,SB Doull (NZ),32,50,11,570,46,14.61,0,0,10,1992,2000,False
2335,FAW Freer (AUS),1,1,1,28,28,NaN,0,0,0,1946,1946,True
648,WW Hall (WI),48,66,14,818,50,15.73,0,2,7,1958,1969,True
1405,DA Marillier (ZIM),5,7,1,186,73,31.00,0,2,0,2000,2002,False

=======================================================================================================================================

#### Now that the dtype is correct and null values are gone, let's do some more feature engineering now.
#### -> Starting from Player column

In [112]:
t20_bat['Player'].head()

0           V Kohli (INDIA)
1         RG Sharma (INDIA)
2           MJ Guptill (NZ)
3    Shoaib Malik (ICC/PAK)
4          BB McCullum (NZ)
Name: Player, dtype: object

##### As you can see, Player column have two components:
- Player Name
- Country Code with some ICC/Asia kind of noise.

#### We need to split this into 'Player_Name' and 'Country_Name' (NOT Country Code)

### Preprocessing

In [107]:
import pandas as pd

# URL from the gist
url = "https://gist.githubusercontent.com/radcliff/f09c0f88344a7fcef373/raw/wikipedia-iso-country-codes.csv"
df_codes = pd.read_csv(url)  # columns: country name, alpha-2, alpha-3, etc.
iso_map = dict(zip(df_codes['Alpha-3 code'].str.upper(), df_codes['English short name lower case'].str.title()))